# EditorInteraction Class

---
Wraps the EditorInteractionType for the Pane to allow for clients to override their type dynamically if need be.
SystemObject Autodesk.Revit.UIEditorInteraction
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class EditorInteraction

    Public Class EditorInteraction

    public ref class EditorInteraction

    type EditorInteraction = class end
The EditorInteraction type exposes the following members.
| Name| Description
---|---|---
| EditorInteraction|  Construct a default interaction.
| EditorInteraction(EditorInteractionType)|  Construct the interaction with the specified type.
Top
| Name| Description
---|---|---
| InteractionType|  The type of interaction.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.UI Namespace